In [30]:
import psycopg2
import pandas as pd

northwind_connection = psycopg2.connect(
    host="localhost",
    port="5432",
    database="Northwind Traders",
    user="postgres",
    password="Viatanoua32"
)
cursor = northwind_connection.cursor()
cursor.execute("""SELECT * FROM categories""")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Beverages', 'Soft drinks coffees teas beers and ales', <memory at 0x0000019A92304E80>)
(2, 'Condiments', 'Sweet and savory sauces relishes spreads and seasonings', <memory at 0x0000019A92304B80>)
(3, 'Confections', 'Desserts candies and sweet breads', <memory at 0x0000019A92304340>)
(4, 'Dairy Products', 'Cheeses', <memory at 0x0000019A92304700>)
(5, 'Grains/Cereals', 'Breads crackers pasta and cereal', <memory at 0x0000019A92307100>)
(6, 'Meat/Poultry', 'Prepared meats', <memory at 0x0000019A923044C0>)
(7, 'Produce', 'Dried fruit and bean curd', <memory at 0x0000019A923047C0>)
(8, 'Seafood', 'Seaweed and fish', <memory at 0x0000019A92304AC0>)

In [31]:
import pandas as pd
import glob

path = 'C:\\pythonProject1\\sql project AncaB\\northwind_data_clean\\data'

csv_files = glob.glob(path + '/*.csv')
dfs = []

for file in csv_files:
    df = pd.read_csv(file, na_values=['NA', 'N/A'])
    dfs.append(df)

combined_df = pd.concat(dfs, ignore_index=True)
combined_df

,categoryID,categoryName,description,picture,customerID,companyName,contactName,contactTitle,address,city,...,quantityPerUnit,unitsInStock,unitsOnOrder,reorderLevel,discontinued,regionID,regionDescription,shipperID,homePage,territoryDescription
0,1.0,Beverages,Soft drinks coffees teas beers and ales,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,Condiments,Sweet and savory sauces relishes spreads and s...,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,Confections,Desserts candies and sweet breads,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,Dairy Products,Cheeses,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,Grains/Cereals,Breads crackers pasta and cereal,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3303,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,SantaClara
3304,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,SantaCruz
3305,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,Bellevue
3306,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,Redmond
3307,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,Seattle

In [32]:
import glob
import pandas as pd
from sqlalchemy import create_engine
import os

csv_files = glob.glob('*.{}'.format('csv'))
df_csv_append = pd.DataFrame()

for file in csv_files:
    df = pd.read_csv(file, na_values=['NA', 'N/A'])
    df_csv_append = df_csv_append.append(df, ignore_index=True)



engine = create_engine('postgresql://postgres:Viatanoua32@localhost:5432/Northwind Traders')

data = df_csv_append
df = pd.DataFrame(data)

table_name = 'all_together'
df.to_sql(table_name, engine, index=False, if_exists='replace')

C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)
C:\Users\User\AppData\Local\Temp\ipykernel_720\3936845190.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_csv_append = df_csv_append.append(df, ignore_index=True)

443

In [33]:
#1
cursor = northwind_connection.cursor()

cursor.execute("""SELECT DISTINCT p.productname
FROM products p
INNER JOIN order_details od ON p.productid = od.productid
INNER JOIN orders o ON od.orderid = o.orderid
WHERE o.orderdate BETWEEN '1996-01-01' AND '1997-12-31';
""")
results = cursor.fetchall()
for row in results:
    print(row)

('Pâté chinois',)
('Flotemysost',)
('Camembert Pierrot',)
('Inlagd Sill',)
('Thüringer Rostbratwurst',)
("Gustaf's Knäckebröd",)
('Carnarvon Tigers',)
('Tofu',)
('Röd Kaviar',)
('Rhönbräu Klosterbier',)
("Sir Rodney's Scones",)
('Nord-Ost Matjeshering',)
('Gorgonzola Telino',)
('Lakkalikööri',)
("Sirop d'érable",)
('Rogede sild',)
('Rössle Sauerkraut',)
("Sir Rodney's Marmalade",)
('Filo Mix',)
('Outback Lager',)
("Chef Anton's Gumbo Mix",)
('Spegesild',)
('Steeleye Stout',)
('Ravioli Angelo',)
('Louisiana Fiery Hot Pepper Sauce',)
('Queso Cabrales',)
('Teatime Chocolate Biscuits',)
('Laughing Lumberjack Lager',)
('Raclette Courdavault',)
('Alice Mutton',)
('Chartreuse verte',)
('Singaporean Hokkien Fried Mee',)
('Mascarpone Fabioli',)
("Grandma's Boysenberry Spread",)
('Sasquatch Ale',)
('Guaraná Fantástica',)
('Schoggi Schokolade',)
('Genen Shouyu',)
('Boston Crab Meat',)
('Aniseed Syrup',)
('Chai',)
('Vegie-spread',)
('Mozzarella di Giovanni',)
('Scottish Longbreads',)
('Ipoh Coffee',)
('Geitost',)
('Chocolade',)
('Konbu',)
('Pavlova',)
('Queso Manchego La Pastora',)
('Côte de Blaye',)
('Gula Malacca',)
('Gnocchi di nonna Alice',)
('Maxilaku',)
('Mishi Kobe Niku',)
('Zaanse koeken',)
('Longlife Tofu',)
('Gudbrandsdalsost',)
('Northwoods Cranberry Sauce',)
('Tunnbröd',)
('Louisiana Hot Spiced Okra',)
('Tourtière',)
('Gravad lax',)
('Gumbär Gummibärchen',)
('Original Frankfurter grüne Soße',)
('NuNuCa Nuß-Nougat-Creme',)
('Chang',)
("Jack's New England Clam Chowder",)
('Manjimup Dried Apples',)
('Valkoinen suklaa',)
('Escargots de Bourgogne',)
('Perth Pasties',)
("Chef Anton's Cajun Seasoning",)
('Ikura',)
('Wimmers gute Semmelknödel',)
("Uncle Bob's Organic Dried Pears",)
('Tarte au sucre',)

In [34]:
#2
cursor.execute("""SELECT productname, unitsinstock
FROM products p
INNER JOIN orders o ON p.productid = o.orderid
WHERE o.orderdate = '1998-05-06';
""")
results = cursor.fetchall()
for row in results:
    print(row)

In [35]:
#3
cursor.execute("""SELECT "productname", "unitprice"
FROM products p
WHERE "unitprice" > 21
ORDER BY "unitprice" desc
LIMIT 3;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

                         0       1
0            Côte de Blaye  263.50
1  Thüringer Rostbratwurst  123.79
2          Mishi Kobe Niku   97.00

In [36]:
#4
cursor.execute("""SELECT "productname", "unitprice"
FROM products
WHERE UnitPrice > 21;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

                                   0       1
0       Chef Anton's Cajun Seasoning   22.00
1             Chef Anton's Gumbo Mix   21.35
2       Grandma's Boysenberry Spread   25.00
3    Uncle Bob's Organic Dried Pears   30.00
4         Northwoods Cranberry Sauce   40.00
5                    Mishi Kobe Niku   97.00
6                              Ikura   31.00
7          Queso Manchego La Pastora   38.00
8                               Tofu   23.25
9                       Alice Mutton   39.00
10                  Carnarvon Tigers   62.50
11            Sir Rodney's Marmalade   81.00
12               Gumbär Gummibärchen   31.23
13                Schoggi Schokolade   43.90
14                 Rössle Sauerkraut   45.60
15           Thüringer Rostbratwurst  123.79
16             Nord-Ost Matjeshering   25.89
17                Mascarpone Fabioli   32.00
18                        Gravad lax   26.00
19                     Côte de Blaye  263.50
20                       Ipoh Coffee   46.00
21             Manjimup Dried Apples   53.00
22                     Perth Pasties   32.80
23                      Pâté chinois   24.00
24            Gnocchi di nonna Alice   38.00
25              Raclette Courdavault   55.00
26                 Camembert Pierrot   34.00
27                    Sirop d'érable   28.50
28                    Tarte au sucre   49.30
29                      Vegie-spread   43.90
30         Wimmers gute Semmelknödel   33.25
31  Louisiana Fiery Hot Pepper Sauce   21.05
32                  Gudbrandsdalsost   36.00
33                       Flotemysost   21.50
34            Mozzarella di Giovanni   34.80

In [37]:
#5
cursor.execute("""SELECT productname
FROM products
WHERE unitprice BETWEEN 5 AND 15;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

                                  0
0                     Aniseed Syrup
1                             Konbu
2        Teatime Chocolate Biscuits
3               Sir Rodney's Scones
4                          Tunnbröd
5           NuNuCa Nuß-Nougat-Creme
6                 Gorgonzola Telino
7                     Sasquatch Ale
8   Jack's New England Clam Chowder
9     Singaporean Hokkien Fried Mee
10                      Rogede sild
11                        Spegesild
12                    Zaanse koeken
13                        Chocolade
14                         Filo Mix
15                        Tourtière
16           Escargots de Bourgogne
17        Laughing Lumberjack Lager
18              Scottish Longbreads
19                    Outback Lager
20                       Röd Kaviar
21                    Longlife Tofu
22             Rhönbräu Klosterbier
23  Original Frankfurter grüne Soße

In [38]:
#6
cursor.execute("""SELECT productname
FROM products
WHERE unitprice < (SELECT AVG(unitprice) FROM products);
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

                                   0
0                               Chai
1                              Chang
2                      Aniseed Syrup
3       Chef Anton's Cajun Seasoning
4             Chef Anton's Gumbo Mix
5       Grandma's Boysenberry Spread
6                     Queso Cabrales
7                              Konbu
8                               Tofu
9                       Genen Shouyu
10                           Pavlova
11        Teatime Chocolate Biscuits
12               Sir Rodney's Scones
13               Gustaf's Knäckebröd
14                          Tunnbröd
15                Guaraná Fantástica
16           NuNuCa Nuß-Nougat-Creme
17             Nord-Ost Matjeshering
18                 Gorgonzola Telino
19                           Geitost
20                     Sasquatch Ale
21                    Steeleye Stout
22                       Inlagd Sill
23                        Gravad lax
24                  Chartreuse verte
25                  Boston Crab Meat
26   Jack's New England Clam Chowder
27     Singaporean Hokkien Fried Mee
28                      Gula Malacca
29                       Rogede sild
30                         Spegesild
31                     Zaanse koeken
32                         Chocolade
33                          Maxilaku
34                  Valkoinen suklaa
35                          Filo Mix
36                         Tourtière
37                      Pâté chinois
38                    Ravioli Angelo
39            Escargots de Bourgogne
40                    Sirop d'érable
41  Louisiana Fiery Hot Pepper Sauce
42         Louisiana Hot Spiced Okra
43         Laughing Lumberjack Lager
44               Scottish Longbreads
45                     Outback Lager
46                       Flotemysost
47                        Röd Kaviar
48                     Longlife Tofu
49              Rhönbräu Klosterbier
50                      Lakkalikööri
51   Original Frankfurter grüne Soße

In [39]:
#7
cursor.execute("""SELECT
    SUM(CASE WHEN o.orderdate >= '1998-01-01' THEN 1 ELSE 0 END) AS verkauft,
    SUM(CASE WHEN p.discontinued = 1 THEN 1 ELSE 0 END) AS eingestellt
FROM
    orders o
JOIN
    order_details od ON o.orderid = od.orderid
JOIN
    products p ON od.productid = p.productid;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

     0    1
0  691  228

In [40]:
#8
cursor.execute("""select
	c.contactname,
	SUM(od.quantity) as total_quantity
from
	customers c
join
    orders o on
	c.customerid = o.customerid
join
    order_details od on
	o.orderid = od.orderid
group by
	c.contactname
order by
	total_quantity desc
limit 1;

select * from customers;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

,0,1,2,3,4,5,6,7,8,9,10
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NULL,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,NULL,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,NULL,05023,Mexico,(5) 555-3932,NULL
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NULL,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,NULL,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
86,WARTH,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,NULL,90110,Finland,981-443655,981-443655
87,WELLI,Wellington Importadora,Paula Parente,Sales Manager,Rua do Mercado 12,Resende,SP,08737-363,Brazil,(14) 555-8122,NULL
88,WHITC,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,WA,98128,USA,(206) 555-4112,(206) 555-4115
89,WILMK,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,NULL,21240,Finland,90-224 8858,90-224 8858
90,WOLZA,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,NULL,01-012,Poland,(26) 642-7012,(26) 642-7012

In [41]:
#9
cursor.execute("""SELECT
    firstname,
    lastname,
    SUBSTRING(hiredate, 1, 4)::integer - SUBSTRING(birthdate, 1, 4)::integer AS alter_eingestellt
FROM
    employees;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

          0          1   2
0     Nancy    Davolio  44
1    Andrew     Fuller  40
2     Janet  Leverling  29
3  Margaret    Peacock  56
4    Steven   Buchanan  38
5   Michael     Suyama  30
6    Robert       King  34
7     Laura   Callahan  36
8      Anne  Dodsworth  28

In [42]:
#10
cursor.execute("""SELECT
    p.productname,
    o.orderid,
    o.orderdate,
    p.unitsinstock,
    od.quantity
FROM
    orders o
INNER JOIN
    order_details od ON o.orderid = od.orderid
INNER JOIN
    products p ON od.productid = p.productid
WHERE
    o.orderdate = (
        SELECT
            MAX(orderdate)
        FROM
            orders
    )
    AND od.quantity > p.unitsinstock;
""")
results = cursor.fetchall()
df = pd.DataFrame(results)
df

       0      1                        2   3   4
0  Chang  11077  1998-05-06 00:00:00.000  17  24

In [43]:
#11
cursor.execute("""SELECT
    e.firstname || ' ' || e.lastname AS verkauefer,
    s.companyname AS transportschiff,
    c.contactname AS kunde,
    p.productname AS produkte
FROM
    employees e
INNER JOIN
    orders o ON e.employeeid = o.employeeid
INNER JOIN
    customers c ON o.customerid = c.customerid
INNER JOIN
    order_details od ON o.orderid = od.orderid
INNER JOIN
    products p ON od.productid = p.productid
INNER JOIN
    shippers s ON o.shipvia = s.shipperid
INNER JOIN
    suppliers ON o.shipvia = suppliers.supplierid
INNER JOIN
    (
        SELECT
            employeeid,
            SUM(od.quantity * od.unitprice) AS total_sales
        FROM
            order_details od
        INNER JOIN
            orders o ON od.orderid = o.orderid
        GROUP BY
            employeeid
        ORDER BY
            total_sales DESC
        LIMIT
            1
    ) AS top_seller ON e.employeeid = top_seller.employeeid
ORDER BY
    verkauefer, transportschiff, kunde, produkte;
"""
)
results = cursor.fetchall()
df = pd.DataFrame(results)
df

,0,1,2,3
0,Margaret Peacock,Federal Shipping,Ana Trujillo,Konbu
1,Margaret Peacock,Federal Shipping,Ana Trujillo,Mozzarella di Giovanni
2,Margaret Peacock,Federal Shipping,Ana Trujillo,Queso Cabrales
3,Margaret Peacock,Federal Shipping,Ana Trujillo,Teatime Chocolate Biscuits
4,Margaret Peacock,Federal Shipping,Anabela Domingues,Chef Anton's Cajun Seasoning
...,...,...,...,...
415,Margaret Peacock,United Package,Thomas Hardy,Valkoinen suklaa
416,Margaret Peacock,United Package,Victoria Ashworth,Gustaf's Knäckebröd
417,Margaret Peacock,United Package,Victoria Ashworth,Konbu
418,Margaret Peacock,United Package,Victoria Ashworth,Spegesild
419,Margaret Peacock,United Package,Yvonne Moncada,Konbu

In [44]:
#12
cursor.execute("""select
	c.contactname as customer,
	p.productname as product,
	MAX(od.quantity) as max_quantity
from
	customers c
inner join
    orders o on
	c.customerid = o.customerid
inner join
    order_details od on
	o.orderid = od.orderid
inner join
    products p on
	od.productid = p.productid
group by
	c.contactname,
	p.productname
having
	MAX(od.quantity) = (
	select
		MAX(quantity)
	from
		order_details
    );
"""
)
results = cursor.fetchall()
df = pd.DataFrame(results)
df

               0                          1    2
0  Roland Mendel           Chartreuse verte  130
1  Roland Mendel  Wimmers gute Semmelknödel  130

In [45]:
#13
cursor.execute("""select c.customerid,
    c.companyname,
    DATE_PART('YEAR', CAST(o.orderdate AS DATE)) AS order_year,
    COUNT(*) AS total_orders
FROM
    customers c
INNER JOIN
    orders o ON c.customerid = o.customerid
WHERE
    DATE_PART('YEAR', CAST(o.orderdate AS DATE)) IN (1996, 1997, 1998)
GROUP BY
    c.customerid,
    c.companyname,
    order_year
ORDER BY
    order_year,
    total_orders DESC;

"""
)
results = cursor.fetchall()
df = pd.DataFrame(results)
df

         0                                   1       2  3
0    QUICK                          QUICK-Stop  1996.0  6
1    RATTC          Rattlesnake Canyon Grocery  1996.0  6
2    ERNSH                        Ernst Handel  1996.0  6
3    HUNGO        Hungry Owl All-Night Grocers  1996.0  5
4    SPLIR               Split Rail Beer & Ale  1996.0  5
..     ...                                 ...     ... ..
229  WARTH                      Wartian Herkku  1998.0  1
230  ANTON             Antonio Moreno Taquería  1998.0  1
231  ANATR  Ana Trujillo Emparedados y helados  1998.0  1
232  SEVES                  Seven Seas Imports  1998.0  1
233  DUMON                     Du monde entier  1998.0  1

[234 rows x 4 columns]

In [46]:
#13
cursor.execute("""SELECT
    e.employeeid,
    e.firstname || ' ' || e.lastname AS employee_name,
    DATE_PART('YEAR', CAST(e.hiredate AS DATE)) AS hire_year,
    COUNT(*) AS total_changes
FROM
    employees e
INNER JOIN
    employee_territories et ON e.employeeid = et.employeeid
INNER JOIN
    orders o ON et.employeeid = o.employeeid
WHERE
    DATE_PART('YEAR', CAST(o.orderdate AS DATE)) IN (1996, 1997, 1998)
GROUP BY
    e.employeeid,
    employee_name,
    hire_year
ORDER BY
    hire_year,
    total_changes DESC;
"""
)
results = cursor.fetchall()
df = pd.DataFrame(results)
df

   0                 1       2    3
0  2     Andrew Fuller  1992.0  672
1  3   Janet Leverling  1992.0  508
2  1     Nancy Davolio  1992.0  246
3  4  Margaret Peacock  1993.0  468
4  6    Michael Suyama  1993.0  335
5  5   Steven Buchanan  1993.0  294
6  7       Robert King  1994.0  720
7  8    Laura Callahan  1994.0  416
8  9    Anne Dodsworth  1994.0  301

In [47]:
#13
cursor.execute("""SELECT
    p.productid,
    p.productname,
    DATE_PART('YEAR', CAST(o.orderdate AS DATE)) AS order_year,
    SUM(od.quantity) AS total_quantity
FROM
    products p
INNER JOIN
    order_details od ON p.productid = od.productid
INNER JOIN
    orders o ON od.orderid = o.orderid
WHERE
    DATE_PART('YEAR', CAST(o.orderdate AS DATE)) IN (1996, 1997, 1998)
GROUP BY
    p.productid,
    p.productname,
    order_year
ORDER BY
    order_year,
    total_quantity DESC;
"""
)
results = cursor.fetchall()
df = pd.DataFrame(results)
df

      0                          1       2    3
0    31          Gorgonzola Telino  1996.0  444
1    60          Camembert Pierrot  1996.0  370
2    35             Steeleye Stout  1996.0  274
3    39           Chartreuse verte  1996.0  266
4    71                Flotemysost  1996.0  261
..   ..                        ...     ...  ...
222  14                       Tofu  1998.0   21
223  73                 Röd Kaviar  1998.0   12
224  48                  Chocolade  1998.0    8
225   9            Mishi Kobe Niku  1998.0    3
226  66  Louisiana Hot Spiced Okra  1998.0    1

[227 rows x 4 columns]